## Pandas Crash Course for ML

### 1. File Reading and Writing
- **Reading and Writing CSV Files**: Learn how to load data from and save data to CSV files.
- **Exploring Other File Formats**: Understand how to handle different file formats like Excel and JSON.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/data.csv')

In [3]:
data = pd.read_json('data/data.json')
data

    name  age
0  Alice   25

In [4]:
import json

data = json.load(open('data/data.json'))
data

[{'name': 'Alice', 'age': 25}]

In [5]:
df = pd.read_csv('data/example.txt')
df

                Hello world!
0  This is an appended line.

In [6]:
df = pd.read_csv('data/example.txt')
df

                Hello world!
0  This is an appended line.

In [7]:
file_path = 'https://raw.githubusercontent.com/laxmimerit/All-CSV-ML-Data-Files-Download/master/titanic.csv'
df = pd.read_csv(file_path)

In [8]:
df.to_csv('data/df_titanic.csv', index=None)

In [9]:
df.to_csv('data/df_titanic_custom_sep.tsv', index=None, sep='\t')

In [10]:
df.to_csv('data/df_titanic_custom_sep.txt', index=None, sep='|')

In [11]:
df = pd.read_csv('data/df_titanic_custom_sep.txt', sep='|')
#df

In [12]:
df.to_excel('data/titanic.xlsx', index=None)

ModuleNotFoundError: No module named 'openpyxl'

### 2. Columns
- **Selecting Columns**: Learn how to access specific columns.
- **Adding and Renaming Columns**: Create new columns and rename existing ones for clarity.

In [ ]:
df.columns, len(df.columns)

(Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
        'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
       dtype='object'),
 12)

In [ ]:
df.columns = [x.lower() for x in df.columns]

In [ ]:
type(df['name']), type(df[['name']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [ ]:
df['family_size'] = df['sibsp'] + df['parch']

In [ ]:
df['fare_per_person'] = df['fare']/(df['family_size']+1)

In [ ]:
df['is_alone'] = df['family_size'].apply(lambda x: 1 if x==0 else 0)
df

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size,is_alone,fare_per_person,is_alone_bool
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,3.62500,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,35.64165,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1,7.92500,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,26.55000,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,1,8.05000,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,1,13.00000,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,1,30.00000,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,0,5.86250,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,1,30.00000,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,1,7.75000,1

In [ ]:
df['is_alone_bool'] = (~df['family_size'].astype('bool')).astype('int')
df

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size,is_alone,fare_per_person,is_alone_bool
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,3.62500,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,35.64165,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1,7.92500,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,26.55000,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,1,8.05000,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0,1,13.00000,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0,1,30.00000,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,0,5.86250,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0,1,30.00000,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0,1,7.75000,1

In [ ]:
df['is_alone_condition'] = (df['family_size']==0).astype('int')

In [ ]:
df = df.rename(columns={'sibsp': 'sibling/spouse aboard'})

In [ ]:
df = df.rename(columns={'pclass': 'passenger_class', 'sex': 'gender'})

In [ ]:
df['is_adult'] = (df['age']>=18).astype(int)

In [ ]:
df[['age', 'is_adult', 'sibling/spouse aboard', 'fare']]

numerical_cols =df.select_dtypes(include='number')
numerical_cols

object_cols = df.select_dtypes(exclude='number')
object_cols.columns

Index(['name', 'gender', 'ticket', 'cabin', 'embarked'], dtype='object')

##### Head, Tail, Sample

In [ ]:
df.head(1)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse aboard,parch,ticket,fare,cabin,embarked,family_size,is_alone,fare_per_person,is_alone_bool,is_alone_condition,is_adult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,1,0,3.625,0,0,1

In [ ]:
df.tail(1)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse aboard,parch,ticket,fare,cabin,embarked,family_size,is_alone,fare_per_person,is_alone_bool,is_alone_condition,is_adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,0,1,7.75,1,1,1

In [14]:
df.sample(5)
df.sample(frac=0.01)

df.sample(frac=0.01, random_state=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
223,224,0,3,"Nenkoff, Mr. Christo",male,NaN,0,0,349234,7.8958,NaN,S
84,85,1,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S
680,681,0,3,"Peters, Miss. Katie",female,NaN,0,0,330935,8.1375,NaN,Q
535,536,1,2,"Hart, Miss. Eva Miriam",female,7.0,0,2,F.C.C. 13529,26.2500,NaN,S
623,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C

### 3. DataFrame and Series
- **Introduction to DataFrame and Series**: Understand the basics of DataFrame and Series, the core structures in Pandas.
- **Indexing and Slicing**: Learn how to access specific rows, columns, or subsets of data.

In [ ]:
df.columns

Index(['passengerid', 'survived', 'passenger_class', 'name', 'gender', 'age',
       'sibling/spouse aboard', 'parch', 'ticket', 'fare', 'cabin', 'embarked',
       'family_size', 'is_alone', 'fare_per_person', 'is_alone_bool',
       'is_alone_condition', 'is_adult'],
      dtype='object')

In [ ]:
type(df['age'])

pandas.core.series.Series

In [ ]:
df[5:10]

# .iloc

type(df.iloc[0])

df.iloc[0:2]

df.iloc[10:20]

df.iloc[10:20]['passenger_class']

df.iloc[1,3]

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [ ]:
df.loc[:1]

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse aboard,parch,ticket,fare,cabin,embarked,family_size,is_alone,fare_per_person,is_alone_bool,is_alone_condition,is_adult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,3.62500,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,35.64165,0,0,1


### 4. Info, Shape, Duplicated, and Drop
- **Data Overview with `.info()` and `.shape()`**: Get a summary of the dataset and its dimensions.
- **Identifying and Dropping Duplicates**: Learn how to find and remove duplicate entries.
- **Dropping Unnecessary Data**: Remove columns or rows that are not needed.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   passengerid            891 non-null    int64
 1   survived               891 non-null    int64
 2   passenger_class        891 non-null    int64
 3   name                   891 non-null    object
 4   gender                 891 non-null    object
 5   age                    714 non-null    float64
 6   sibling/spouse aboard  891 non-null    int64
 7   parch                  891 non-null    int64
 8   ticket                 891 non-null    object
 9   fare                   891 non-null    float64
 10  cabin                  204 non-null    object
 11  embarked               889 non-null    object
 12  family_size            891 non-null    int64
 13  is_alone               891 non-null    int64
 14  fare_per_person        891 non-null    float64
 15  is_alone_bool          891 non-null    int64
 16  is_alone_condition     891 non-null    int64
 17  is_adult               891 non-null    int64
dtypes: float64(3), int64(10), object(5)
memory usage: 125.4+ KB

In [ ]:
df.isnull().sum()

df.shape

(891, 18)

In [ ]:
df.describe()

,passengerid,survived,passenger_class,age,sibling/spouse aboard,parch,fare,family_size,is_alone,fare_per_person,is_alone_bool,is_alone_condition,is_adult
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.904602,0.602694,19.916375,0.602694,0.602694,0.674523
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,1.613459,0.489615,35.841257,0.489615,0.489615,0.468816
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000,0.000000,7.250000,0.000000,0.000000,0.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000,1.000000,8.300000,1.000000,1.000000,1.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000,1.000000,23.666667,1.000000,1.000000,1.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,10.000000,1.000000,512.329200,1.000000,1.000000,1.000000

In [ ]:
df.duplicated().sum()

np.int64(0)

In [ ]:
df = df.drop_duplicates()

In [ ]:
df.isnull().sum()

df1 = df.dropna()
df.shape, df1.shape

((891, 18), (183, 18))

In [ ]:
df1 = df.dropna(subset=['embarked'])
df.shape, df1.shape

((891, 18), (889, 18))

In [ ]:
df1.isnull().sum()

passengerid                0
survived                   0
passenger_class            0
name                       0
gender                     0
age                      177
sibling/spouse aboard      0
parch                      0
ticket                     0
fare                       0
cabin                    687
embarked                   0
family_size                0
is_alone                   0
fare_per_person            0
is_alone_bool              0
is_alone_condition         0
is_adult                   0
dtype: int64

### 5. Filtering Data
- **Basic Filtering**: Learn how to filter DataFrame rows based on conditions.
- **Multiple Conditions**: Apply multiple conditions to filter data.

In [ ]:
flag = df['age'].isnull()
df[flag]

df1 = df[~flag]

df1[df1['age']>50]

flag = (df1['age']>50) & (df1['age']<60)
df1[flag]

df[(df['gender']=='male')&(df['is_adult']==0)]

### 6. NaN and Null Values
- **Identifying and Handling Missing Data**: Discover how to find and manage NaN or null values in your dataset.

In [ ]:
df.isnull().sum()

# fillna
df1 = df.fillna('filling with something')

In [ ]:
df1 = df.copy()
df1['cabin'] = df['cabin'].fillna('filling with something')

In [ ]:
# df1 = df.copy()

df1 = df.fillna({'cabin': 'fill something in cabin', 'embarked': 'fill something'})

In [ ]:
df1 = df.copy()

df1['cabin'] = df1['cabin'].ffill()
df1['cabin'] = df1['cabin'].bfill()

In [ ]:
df1 = df1.dropna(thresh=len(df1)*0.99, axis=1)

### 7. Imputation
- **Filling Missing Data**: Replace NaN values with appropriate values using different strategies.

In [ ]:
df1 = df.copy()

# df1['age'] = df1['age'].fillna(df1['age'].mean())
# df1['age'].fillna(df1['age'].mean(), inplace=True)

# df1.fillna({'age': df1['age'].mean()}, inplace=True)

In [ ]:
df1['age'].median(), df1['age'].mean()

(np.float64(28.0), np.float64(29.69911764705882))

In [ ]:
df1.fillna({'age': df1['age'].median()}, inplace=True)

In [ ]:
df1['cabin'].mode()[2]

'G6'

In [ ]:
df1.fillna({'cabin': df1['cabin'].mode()[2]}, inplace=True)

In [ ]:
age1 = df1['age']

df1 = df.copy()

df1['age'] = df1['age'].interpolate()

age2 = df1['age']

In [ ]:
age = pd.DataFrame([df['age'].fillna(df['age'].mean()), age2]).T

### 8. Lambda Function
- **Applying Functions with `apply()`**: Use lambda functions for custom operations across rows or columns.

In [ ]:
df['age'] = df['age'].interpolate()

In [ ]:
df['is_teen'] = df['age'].apply(lambda x: 1 if (x<18) & (x>14) else 0)
df['is_child'] = df['age'].apply(lambda x: 1 if x<=14 else 0)

df['is_senior'] = df['age'].apply(lambda x: 1 if x>=60 else 0)

In [ ]:
df['is_teen'].value_counts()
df['is_child'].value_counts()
df['is_senior'].value_counts()

df[df['is_senior']==1][['age', 'is_senior']].head()

      age  is_senior
33   66.0          1
54   65.0          1
95   65.0          1
96   71.0          1
116  70.5          1

In [ ]:
df['fare_per_family_person'] = df.apply(lambda x: x['fare']/(x['family_size']+1), axis=1)

In [ ]:
df['name'].str.len()
df['name_length'] = df['name'].apply(lambda x: len(x))

In [ ]:
df['title'] = df['name'].apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [ ]:
df.head(3)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse aboard,parch,ticket,fare,...,fare_per_person,is_alone_bool,is_alone_condition,is_adult,is_teen,is_child,is_senior,fare_per_family_person,name_length,title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,3.62500,0,0,1,0,0,0,3.62500,23,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,35.64165,0,0,1,0,0,0,35.64165,51,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,7.92500,1,1,1,0,0,0,7.92500,22,Miss

### 9. Grouping and Aggregation
- **Grouping Data**: Learn how to group data by one or more columns.
- **Aggregating Data**: Perform operations like mean, sum, and count on grouped data.

In [ ]:
# mostly-> grouping on categorical datatype and agg-> numerical datatype
df.columns

In [ ]:
df1 = df.groupby('passenger_class')
df1.groups.keys()

In [ ]:
df1['age'].mean()

In [ ]:
df1 = df.groupby('gender')
df1['age'].mean()

In [ ]:
df1 = df.groupby(['gender', 'passenger_class'])

df1.groups

df1['age'].mean()

In [ ]:
df1[['age', 'fare']].mean()

In [ ]:
df1.agg({'age': ['mean', 'median'], 'fare': ['sum', 'mean', 'median']})

In [ ]:
df['embarked'].value_counts()

In [ ]:
df1 = df.groupby('embarked')
df1['passengerid'].count()

### 10. Merging and Joining DataFrames
- **Combining DataFrames**: Learn how to merge or join DataFrames.
- **Different Types of Joins**: Understand inner, outer, left, and right joins.

In [ ]:
df1 = df[['passengerid', 'name', 'age']].head(5)
df2 = df[['passengerid', 'fare', 'embarked']].head(10)

In [ ]:
df1

In [ ]:
# df2

In [ ]:
df3 = pd.merge(df1, df2, on='passengerid', how='inner')
df3

In [ ]:
df3 = pd.merge(df1, df2, on='passengerid', how='left')
df3

In [ ]:
df3 = pd.merge(df1, df2, on='passengerid', how='right')
df3

In [ ]:
df3 = pd.merge(df1, df2, on='passengerid', how='outer')
df3

In [ ]:
pd.concat([df1, df2], axis=1)

In [ ]:
# pd.append => pd.concat([df1, df2], axis=0)

### 11. Sorting Data
- **Sorting Rows**: Learn how to sort data by one or more columns.
- **Sorting with Different Orders**: Understand how to sort in ascending or descending order.

In [ ]:
df.sort_values(by='age')

df.sort_values(by='age', ascending=False)

df.sort_values(by=['age', 'fare'])

df1 = df.sort_values(by=['passenger_class', 'fare'])

df1.sort_index().head(1)

In [ ]:
df.sort_values(by='name_length')

df1 = df.sort_values(by=['passenger_class', 'fare'], ascending=[True, False])


### 12. Handling Categorical Data
- **Working with Categorical Data**: Learn how to handle and manipulate categorical data in Pandas.
- **Converting Categories to Numeric**: Convert categorical data to numeric for machine learning.

In [ ]:
df['gender'].dtype
# df.info()

In [ ]:
df['gender'] = df['gender'].astype('category')
# df.info()

In [ ]:
df['gender'].value_counts().index

In [ ]:
df['gender'].unique()

In [ ]:
df['gender'].nunique()

In [ ]:
df['gender'].cat.codes

gender = pd.get_dummies(df['gender']).astype('int')
# gender

In [ ]:
df['gender'].apply(lambda x: 'm' if x=='male' else 'f')
# df['gender'].replace({'male': 'm', 'female': 'f'})

df['gender'].cat.rename_categories({'male': 'm', 'female': 'f'})

df['gender'].map({'male': 'm', 'female': 'f'})

### 13. Handling Dates
- **Working with Date Data**: Learn how to handle date and time data in Pandas.
- **Date-based Indexing and Resampling**: Perform operations based on dates.

In [ ]:
df = pd.read_csv('https://github.com/laxmimerit/All-CSV-ML-Data-Files-Download/raw/master/jamesbond.csv')
df.head()

df['Year'] = pd.to_datetime(df['Year'], format='%Y')

In [ ]:
df['Year'].dt.year
df['Year'].dt.month

df['Year'].dt.month_name()
df['Year'].dt.day

pd.to_datetime('now').year
pd.to_datetime('now').month_name()
pd.to_datetime('now').day_name()

In [ ]:
df[df['Year']>pd.to_datetime('2000')]

In [ ]:
pd.date_range(start='2000', end='2002', freq='ME')